tutorials/fluidSolidInteraction/3dTube/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    pipe
    {
        type            linearElastic;
        //type            StVenantKirchhoffElastic;
        rho             rho [1 -3 0 0 0 0 0]  1200;
        E               E   [1 -1 -2 0 0 0 0] 3e5;
        nu              nu  [0 0 0 0 0 0 0]   0.3;
    }
);

// ************************************************************************* //
